# StairsPathStartFromRiser Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsPathStartFromRiser Property
ParameterTypeId Class See Also
---
"Start from Riser"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsPathStartFromRiser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsPathStartFromRiser As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsPathStartFromRiser {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace